# Задание №1
second = int(input('Введите колличество секунд: '))
if second < 60:
    print(second, 'сек')
elif 60 <= second < 3600:
    min = second // 60
    second = second % 60
    print(min, 'мин', second,'сек')
elif 3600 <= second < 86400:
    hour = second // 3600
    min = (second % 3600)//60
    second = (second % 3600)%60
    print(hour,'час' ,min, 'мин', second,'сек')

# Задание №2
odd_numbers_cube = []
total = 0
for i in range(1,1001,2):
    number = i ** 3
    sum_numbers = 0
    while number > 0:
        sum_numbers = (number % 10) +sum_numbers
        number = number // 10
    if sum_numbers % 7 == 0:
        total = (i ** 3)+total
    odd_numbers_cube.append(i ** 3)
print(total)

# Задание №3
#squares = {x: 'Процент' for x in range(1 , 101)}
#print(squares)
declination = {
    1: 'Процент', 2: 'Процента', 3: 'Процента', 4: 'Процента', 5: 'Процентов', 6: 'Процентов', 7: 'Процентов', 8: 'Процентов', 9: 'Процентов', 10: 'Процентов', 11: 'Процентов', 12: 'Процентов', 13: 'Процентов', 14: 'Процентов', 15: 'Процентов', 16: 'Процентов', 17: 'Процентов', 18: 'Процентов', 19: 'Процентов', 20: 'Процентов', 21: 'Процент', 22: 'Процента', 23: 'Процента', 24: 'Процента', 25: 'Процентов', 26: 'Процентов', 27: 'Процентов', 28: 'Процентов', 29: 'Процентов', 30: 'Процентов', 31: 'Процент', 32: 'Процента', 33: 'Процента', 34: 'Процента', 35: 'Процентов', 36: 'Процентов', 37: 'Процентов', 38: 'Процентов', 39: 'Процентов', 40: 'Процентов', 41: 'Процент', 42: 'Процента', 43: 'Процента', 44: 'Процента', 45: 'Процентов', 46: 'Процентов', 47: 'Процентов', 48: 'Процентов', 49: 'Процентов', 50: 'Процентов', 51: 'Процент', 52: 'Процента', 53: 'Процента', 54: 'Процента', 55: 'Процентов', 56: 'Процентов', 57: 'Процентов', 58: 'Процентов', 59: 'Процентов', 60: 'Процентов', 61: 'Процент', 62: 'Процента', 63: 'Процента', 64: 'Процента', 65: 'Процентов', 66: 'Процентов', 67: 'Процентов', 68: 'Процентов', 69: 'Процентов', 70: 'Процентов', 71: 'Процент', 72: 'Процента', 73: 'Процента', 74: 'Процента', 75: 'Процентов', 76: 'Процентов', 77: 'Процентов', 78: 'Процентов', 79: 'Процентов', 80: 'Процентов', 81: 'Процент', 82: 'Процента', 83: 'Процента', 84: 'Процента', 85: 'Процентов', 86: 'Процентов', 87: 'Процентов', 88: 'Процентов', 89: 'Процентов', 90: 'Процентов', 91: 'Процент', 92: 'Процента', 93: 'Процента', 94: 'Процента', 95: 'Процентов', 96: 'Процентов', 97: 'Процентов', 98: 'Процентов' , 99: 'Процентов', 100: 'Процентов'
}
for key, value in declination.items():
    print(key, value)






